In [1]:
#importation des bibliothèques nécessaires
import pandas as pd
import json
import pyodbc

In [2]:
#affichage du dataset
df = pd.read_csv('insurance.csv')
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [3]:
#fiche technique du dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [4]:
#vérification de l'existence des valeurs manquantes
df.isna().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [5]:
df.duplicated().sum()

1

In [6]:
df.drop_duplicates(inplace = True)

In [7]:
df.duplicated().sum()

0

In [8]:
# Mélanger les lignes pour garantir une répartition aléatoire des données
df = df.sample(frac=1).reset_index(drop=True)
df.head()

   age     sex     bmi  children smoker     region      charges
0   20  female  22.420         0    yes  northwest  14711.74380
1   38    male  31.000         1     no  southwest   5488.26200
2   18    male  21.780         2     no  southeast  11884.04858
3   57  female  31.825         0     no  northwest  11842.62375
4   32  female  17.765         2    yes  northwest  32734.18630

# Calculer le nombre de lignes pour chaque partie en utilisant le pourcentage spécifié

In [9]:
# json_percentage = int(input("Entrez le pourcentage du fichier JSON: "))
# db_percentage = int(input("Entrez le pourcentage du fichier Database: "))
# csv_percentage = int(input("Entrez le pourcentage du fichier CSV: "))

In [10]:
json_percentage = 0
db_percentage = 0
csv_percentage = 0

# Boucle jusqu'à ce que la somme des pourcentages soit égale à 100
while json_percentage + db_percentage + csv_percentage != 100:
    json_percentage = int(input("Entrez le pourcentage du fichier JSON (Ex:25): %"))
    db_percentage = int(input("Entrez le pourcentage du fichier Database(Ex:35): %"))
    csv_percentage = int(input("Entrez le pourcentage du fichier CSV(Ex:40): %"))

    # Vérifiez si la somme n'est pas égale à 100
    if json_percentage + db_percentage + csv_percentage != 100:
        print("Erreur : La somme des pourcentages doit être égale à 100. Veuillez réessayer.")

Entrez le pourcentage du fichier JSON (Ex:25): % 25
Entrez le pourcentage du fichier Database(Ex:35): % 35
Entrez le pourcentage du fichier CSV(Ex:40): % 40

In [11]:
total_rows = len(df)
total_rows

1337

In [12]:
# Pourcentage de données à transférer vers chaque type de fichier
# db_json_rows_percentage = 30  
# db_rows = int(total_rows * (db_json_rows_percentage / 100))
# json_rows = db_rows
# csv_rows = total_rows - db_rows - json_rows

In [13]:
# Pourcentage de données à transférer vers chaque type de fichier
json_rows = int(total_rows * json_percentage / 100)
db_rows = int(total_rows * db_percentage / 100)
csv_rows = total_rows - json_rows - db_rows

In [14]:
json_rows, db_rows, csv_rows

(334, 467, 536)

# Diviser les données en trois parties

In [15]:
json_data = df[:json_rows]
db_data = df[json_rows:json_rows + db_rows]
csv_data = df[json_rows + db_rows:]

In [16]:
json_data

     age     sex     bmi  children smoker     region      charges
0     20  female  22.420         0    yes  northwest  14711.74380
1     38    male  31.000         1     no  southwest   5488.26200
2     18    male  21.780         2     no  southeast  11884.04858
3     57  female  31.825         0     no  northwest  11842.62375
4     32  female  17.765         2    yes  northwest  32734.18630
..   ...     ...     ...       ...    ...        ...          ...
329   26  female  29.920         2     no  southeast   3981.97680
330   48  female  32.230         1     no  southeast   8871.15170
331   19    male  34.800         0    yes  southwest  34779.61500
332   35    male  27.740         2    yes  northeast  20984.09360
333   37    male  30.875         3     no  northwest   6796.86325

[334 rows x 7 columns]

In [17]:
db_data

     age     sex    bmi  children smoker     region      charges
334   30  female  32.40         1     no  southwest   4149.73600
335   19  female  34.70         2    yes  southwest  36397.57600
336   21    male  23.75         2     no  northwest   3077.09550
337   59    male  25.46         0     no  northwest  12124.99240
338   27  female  30.59         1     no  northeast  16796.41194
..   ...     ...    ...       ...    ...        ...          ...
796   32  female  23.65         1     no  southeast  17626.23951
797   56    male  22.10         0     no  southwest  10577.08700
798   21  female  39.49         0     no  southeast   2026.97410
799   33  female  18.50         1     no  southwest   4766.02200
800   49  female  27.17         0     no  southeast   8601.32930

[467 rows x 7 columns]

In [18]:
csv_data

      age     sex     bmi  children smoker     region      charges
801    52    male  24.320         3    yes  northeast  24869.83680
802    18    male  28.310         1     no  northeast  11272.33139
803    32  female  29.735         0     no  northwest   4357.04365
804    31    male  29.810         0    yes  southeast  19350.36890
805    18    male  31.680         2    yes  southeast  34303.16720
...   ...     ...     ...       ...    ...        ...          ...
1332   31  female  32.680         1     no  northwest   4738.26820
1333   52  female  37.400         0     no  southwest   9634.53800
1334   31  female  25.740         0     no  southeast   3756.62160
1335   59  female  34.800         2     no  southwest  36910.60803
1336   55  female  40.810         3     no  southeast  12485.80090

[536 rows x 7 columns]

# Sauvegarder les données au format CSV (en excluant l'en-tête)

In [19]:
csv_data.to_csv('insurance_split_csv.csv', index=False)

# Sauvegarder les données au format JSON

In [20]:
json_data.to_json('insurance_split_json.json', orient='records', lines=True)

In [21]:
json_data = []

with open('insurance_split.json', "r") as json_file:
    # Read the JSON data from the file
    for line in json_file:
        json_object = json.loads(line)
        json_data.append(json_object)

json_data[:5]

[{'age': 33,
  'sex': 'male',
  'bmi': 42.46,
  'children': 1,
  'smoker': 'no',
  'region': 'southeast',
  'charges': 11326.71487},
 {'age': 44,
  'sex': 'male',
  'bmi': 34.32,
  'children': 1,
  'smoker': 'no',
  'region': 'southeast',
  'charges': 7147.4728},
 {'age': 42,
  'sex': 'male',
  'bmi': 26.125,
  'children': 2,
  'smoker': 'no',
  'region': 'northeast',
  'charges': 7729.64575},
 {'age': 58,
  'sex': 'male',
  'bmi': 34.39,
  'children': 0,
  'smoker': 'no',
  'region': 'northwest',
  'charges': 11743.9341},
 {'age': 24,
  'sex': 'female',
  'bmi': 20.52,
  'children': 0,
  'smoker': 'yes',
  'region': 'northeast',
  'charges': 14571.8908}]

# Sauvegarder les données à une base de données relationnelle

In [22]:
df.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [23]:
driver = 'SQL Server'
server = 'LAPTOP-EEA5QPRQ\SQLEXPRESS'
database = 'DataSplitter'

# Établir une connexion au serveur SQL Server sans base de données spécifique
conn = pyodbc.connect(f'''
                        DRIVER={driver};
                        SERVER={server};
                        DATABASE={database};
                        Trusted_Connection=yes
                       ''')
# Créer un curseur pour exécuter les requêtes
cursor = conn.cursor()

In [25]:
# supprimer de la table Insurance si il existe déjà
cursor.execute('DROP TABLE IF EXISTS Insurance')

#créer la table Insurance
cursor.execute( 
    ''' 
      CREATE TABLE Insurance (
        age INT,
        sex VARCHAR(255),
        bmi FLOAT,
        children INT,
        smoker VARCHAR(255),
        region VARCHAR(255),
        charges FLOAT
        )
    '''
              )      
print('La table Insurance a été créée avec succès')

La table Insurance a été créée avec succès

In [26]:
# Parcourir chaque ligne de la dataframe "db_data"
for index, row in db_data.iterrows():
    age = row['age']
    sex = row['sex']
    bmi = row['bmi']
    children = row['children']
    smoker = row['smoker']
    region = row['region']
    charges = row['charges']
    
    # Exécuter une requête INSERT pour insérer les valeurs dans la table "Insurance"
    #cursor.execute(f"INSERT INTO Insurance (age, sex, bmi, children, smoker, region, charges) VALUES ({age}, {sex}, {bmi}, {children}, {smoker}, {region}, {charges})")
    cursor.execute("""
        INSERT INTO Insurance (age, sex, bmi, children, smoker, region, charges)
        VALUES (?, ?, ?, ?, ?, ?,?)
    """, age, sex, bmi, children, smoker, region, charges)
print('La table Insurance a été insérée avec succès')

La table Insurance a été insérée avec succès

In [27]:
# Validez les modifications et fermez la connexion
conn.commit()
conn.close()